app/Controllers/Admin.php

SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `status` = 'Proses'
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `status` = 'Selesai'
SELECT SUM(`total_price`) AS `total_price`
FROM `orders`
WHERE `status` = 'Selesai'
SELECT *
FROM `orders`
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function dashboard() {
        if (!session()->get('isLoggedIn') || session()->get('role') != 'admin') {
            return redirect()->to('/login');
        }
        $orderModel = new OrderModel();
        $data = [
            'count_pending' => $orderModel->where('status', 'Pending')->countAllResults(),
            'count_proses'  => $orderModel->where('status', 'Proses')->countAllResults(),
            'count_selesai' => $orderModel->where('status', 'Selesai')->countAllResults(),
            'income'        => $orderModel->where('status', 'Selesai')->selectSum('total_price')->get()->getRow()->total_price,
            'latest_orders' => $orderModel->orderBy('created_at', 'DESC')->findAll(5)

SELECT *
FROM `orders`
ORDER BY `created_at` DESC
---
    public function orders() {
        if (!session()->get('isLoggedIn') || session()->get('role') != 'admin') {
            return redirect()->to('/login');
        }
        $orderModel = new OrderModel();
        $data['orders'] = $orderModel->orderBy('created_at', 'DESC')->findAll();

SELECT *
FROM `messages`
ORDER BY `created_at` DESC
---
    public function messages() {
        if (!session()->get('isLoggedIn') || session()->get('role') != 'admin') {
            return redirect()->to('/login');
        }
        $messageModel = new \App\Models\MessageModel();
        $data['messages'] = $messageModel->orderBy('created_at', 'DESC')->findAll();

SELECT *
FROM `settings`
WHERE `settings`.`id` = 1
---
    public function settings()
    {
        if (!session()->get('isLoggedIn') || session()->get('role') != 'admin') {
            return redirect()->to('/login');
        }

        $settingsModel = new \App\Models\SettingsModel();

        // Ambil data settings (ID 1)
        $data['settings'] = $settingsModel->find(1);

UPDATE `settings` SET `price_daily` = '8000.00', `price_express` = '10000.00', `price_dry` = '5000.00', `price_iron` = '5000.00', `price_complete` = '10000.00', `desc_daily` = 'Layanan cuci dan setrika harian dengan proses standar. Cocok untuk kebutuhan laundry rutin dengan hasil bersih, rapi, dan wangi. Estimasi selesai 2–3 hari. Harga 8000', `desc_express` = 'adasd', `desc_dry` = 'asdsa', `desc_iron` = '', `desc_complete` = '', `bank_name` = 'BNI', `bank_number` = '1846646794', `bank_holder` = 'Freshora Laundry', `whatsapp_admin` = '6282313051938'
WHERE `settings`.`id` IN (1)
---
            $data['qris_image'] = $namaQris;
        }

        $settingsModel->update(1, $data); // Update ID 1

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
UPDATE `users` SET `password` = '$2y$10$6tZokxgY7JNuhJmy3XZ6AOqzn9qRkKzLalNaKBx4mskIf4ZVIOV4W'
WHERE `users`.`id` IN ('3')
---
    public function password_update()
    {
        if (!session()->get('isLoggedIn') || session()->get('role') != 'admin') {
            return redirect()->to('/login');
        }

        $userModel = new \App\Models\UserModel();
        $adminId = session()->get('user_id');
        $admin = $userModel->find($adminId);

        $oldPass = $this->request->getPost('old_password');
        $newPass = $this->request->getPost('new_password');
        $confPass = $this->request->getPost('confirm_password');

        // 1. Cek Password Lama
        if (!password_verify($oldPass, $admin['password'])) {
            return redirect()->back()->with('error', 'Password lama salah!');
        }

        // 2. Cek Konfirmasi Password
        if ($newPass != $confPass) {
            return redirect()->back()->with('error', 'Konfirmasi password tidak cocok!');
        }

        // 3. Update Password Baru
        $userModel->update($adminId, [
            'password' => password_hash($newPass, PASSWORD_DEFAULT)
        ]);