app/Controllers/Home.php

    public function index()
    {
    $settingsModel = new \App\Models\SettingsModel();

    $data['settings'] = $settingsModel->find(1);
---
SELECT *
FROM `settings`
WHERE `settings`.`id` = 1